# -*- coding: utf-8 -*-

lst = [['操作类型', '进入房间', '主动离开房间', '被动离开房间', '成为主持人', '主持人自己离开', '主持人被下', '设为管理', '取消管理', '辞职管理', '申请上台', '同意上台', '拒绝上台', '被动上台', '取消申请', '拒绝申请', '主动下台', '被动下台', '拉黑', '踢人', '主动关麦', '被动关麦', '主动离座', '被动离座', '点歌', '换歌', '开始游戏', '唱歌', '切歌', '点评', '修改房间配置', '送礼', '游戏结束', '切换游戏', '修改公告', '送荧光棒', '送通关卷', '发言', '聊天', '离开房间'], ['游戏流程', '围观→申请', '围观→嘉宾', '申请→围观', '申请→嘉宾', '嘉宾→围观', '未点歌→点歌中', '点歌中→已点歌', '已点歌→点歌中', '未点歌→准备演唱', '点歌中→准备演唱', '已点歌→准备演唱', '已点歌→等待演唱', '等待演唱→准备演唱', '准备演唱→演唱中', '演唱中→点评中', '点评中→等待结束', '点评中→游戏结束', '等待结束→游戏结束'], ['角色', '房主', '管理员', '主持人', '演唱嘉宾', '等待上台嘉宾', '观众'], ['操作入口', '观众席', '申请列表', '嘉宾席', '房间设置', '房间按钮', '房间输入框'], ['操作对象', '房主', '管理员', '主持人', '演唱嘉宾', '等待上台嘉宾', '观众', '房间'], ['同步对象', '房主', '管理员', '主持人', '演唱嘉宾', '等待上台嘉宾', '观众', '房间']]
print(lst)
